<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="?,3,736,992" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_892" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4" offset="0" size="16" />
			<output>
				<port id="0" precision="FP32" names="onnx::Add_1266">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Range_2624" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Range_2622,onnx::Range_2624,onnx::Range_2628,onnx::Range_2630,onnx::Range_2634,onnx::Range_2636,onnx::Range_2640,onnx::Range_2642,onnx::Range_2646,onnx::Range_2648,onnx::Range_2694" />
			</output>
		</layer>
		<layer id="3" name="Constant_92083" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="24" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Subtract_92084" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_209488" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="36" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Divide_92086" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx::Conv_2387" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="48" size="3456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2387">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_139/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_193" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3504" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_139" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2386">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Clip_142" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_374">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Conv_2390" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="3632" size="4096" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2390">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_143/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_245" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7728" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_143" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2389">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Clip_146" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_379">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_284" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="7856" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_147/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_370" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="9008" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_147" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2392">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Clip_150" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_384">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_2396" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="9136" size="2048" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2396">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_151/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_422" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11184" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_151" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.15">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx::Conv_2399" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="11248" size="6144" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2399">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_152/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_470" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="17392" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_152" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2398">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Clip_155" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_391">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_509" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="17776" size="3456" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_156/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_595" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="21232" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_156" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2401">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Clip_159" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_396">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="onnx::Conv_2405" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="21616" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2405">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_160/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_647" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="30832" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_160" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.31">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx::Conv_2408" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="30928" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2408">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_161/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_695" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="44752" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_161" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2407">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Clip_164" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_403">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_734" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="45328" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_165/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_820" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="50512" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_165" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2410">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Clip_168" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_408">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Conv_2414" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="51088" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2414">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_169/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_872" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="64912" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_169" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Add_2413">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Add_170" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.47">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="onnx::Conv_2417" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="65008" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2417">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_171/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_921" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="78832" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_171" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2416">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Clip_174" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_416">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_960" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="79408" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_175/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_1046" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="84592" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_175" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2419">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Clip_178" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_421">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx::Conv_2423" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="85168" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2423">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_179/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_1098" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="103600" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_179" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.63">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Conv_2426" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="103728" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2426">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_180/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Reshape_1146" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="128304" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_180" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2425">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Clip_183" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_428">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_1185" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="129072" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_184/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_1271" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="135984" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_184" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2428">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Clip_187" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_433">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="onnx::Conv_2432" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="136752" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2432">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_188/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_1323" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="161328" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_188" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Add_2431">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Add_189" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.79">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx::Conv_2435" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="161456" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2435">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_190/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_1372" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="186032" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_190" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2434">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Clip_193" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_441">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_1411" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="186800" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_194/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_1497" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="193712" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_194" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2437">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Clip_197" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_446">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="onnx::Conv_2441" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="194480" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2441">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_198/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_1549" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="219056" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_198" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Add_2440">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Add_199" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.95">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="neck.lateral_convs.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 1, 1" offset="219184" size="8192" />
			<output>
				<port id="0" precision="FP32" names="neck.lateral_convs.0.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_306/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_4080" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="227376" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_306" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Shape_589">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="onnx::Conv_2444" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="227632" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2444">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_200/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_1598" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="252208" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_200" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2443">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Clip_203" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_454">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_1637" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="252976" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_204/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Reshape_1723" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="259888" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_204" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>46</dim>
					<dim>62</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Clip_2446">
					<dim>-1</dim>
